:PROPERTIES:
:ID:       2751eba5-342f-49e2-ac4d-cbc201030362
:END:
#+TITLE: Ansible: Use jq to query pfsense XML backups
#+CATEGORY: slips
#+TAGS:

** Useful scripts

Produce a list of files for bash forloop

#+begin_src shell :results output
for x in filter-{lan,opt1}.yml; do
    echo $x
done
#+end_src

#+RESULTS:
: filter-lan.yml
: filter-opt1.yml

Pass something to =reducee= in =jq=.

#+begin_src shell
echo "[13,17,19]" | jq 'reduce ([1,2,3,4,5,6] | to_entries[]) as $kv (5; . * $kv.value)'
#+end_src

#+RESULTS:
: 3600

** Extract Uniq Values

For a single interface

#+header: :var file=(expand-file-name "filter-config.yml" backup-path)
#+begin_src shell :results output
columns="{ id, tracker, decsr, interface, floating, type, direction, ipprotocol, protocol, source, destination, disabled }"

yq ".lan | group_by(.ipprotocol)
    | map({ (first.ipprotocol): length })" $file | yq -y .
#+end_src

#+RESULTS:
: - inet: 7
: - inet46: 15
: - inet6: 1

Mapping across interfaces

... =group_by= doesn't work when column values are null, which is more or less
what I am trying to determine.

#+header: :var file=(expand-file-name "filter-config.yml" backup-path)
#+begin_src shell :results output
col=ipprotocol

yq "map_values(group_by(.$col)
    | map({ (first.$col): length }))" $file | yq -y .
#+end_src

#+RESULTS:
#+begin_example
lan:
  - inet: 7
  - inet46: 15
  - inet6: 1
opt1:
  - inet: 4
  - inet46: 32
opt2:
  - inet46: 5
opt3:
  - inet: 2
  - inet46: 24
#+end_example

Close ... but probably too complicated (reduce requires an inner map and/or group_by)

#+header: :var file=(expand-file-name "filter-config.yml" backup-path)
#+begin_src shell :results output
columns='["type", "direction", "ipprotocol", "protocol", "source", "destination", "disabled"]'

yq "to_entries
    | map(.value
      | . as \$this
      | reduce ($columns | .[]) as \$col (\$this; \$this += {(\$col): \$col}))
     " $file
#+end_src

#+RESULTS:
: jq: error (at <stdin>:1): array ([{"id":null...) and object ({"type":"ty...) cannot be added
: [ Babel evaluation exited with code 5 ]


